{"test": {
  "start_message": "Тест на тип привязанности\n\nУзнай, как ты строишь близкие отношения\nТест покажет твой тип привязанности:\nкак ты воспринимаешь близость, доверие и свободу\n\n1 - Совсем на меня не похоже\n7 - Очень на меня похоже\n\nНАЧАТЬ ТЕСТ?",
  "types": {
        "A": {
        "name": "📌 НАДЁЖНЫЙ ТИП: ШТАТНЫЙ РЕЖИМ ",
        "description": "Что это? Твоя базовая стратегия выживания в мире людей. Совокупность внутренних команд, по которым работает твоя психика. \n\nЭто не про то, что у тебя нет никаких проблем. Это про то, что твоя психика не тратит 90٪ ресурсов на войну с самим собой. Для тебя отношения — это не территория сражений, не служба спасения и не минное поле. Это просто отношения, безопасная среда. Твоя самоценность не зависит от отношений.Твоя суперсила в том, что для тебя это не суперсила, а штатный режим работы психики. \n\n· Базовая стратегия: Возникает потребность или проблема → спокойная внутренняя оценка: «Что я чувствую? Что мне нужно?» → прямой коммуникативный шаг: попросить, поддержать, отклонить, обсудить.\n\nЧто у тебя в голове? Читать здесь👇",
        "characteristics": [
            "Открытость в общении и близости",
            "Здоровые границы в отношениях",
            "Умение разрешать конфликты конструктивно",
            "Способность к эмоциональной поддержке"
        ],
        "recommendations": [
            "Продолжай развивать эмпатию и эмоциональный интеллект",
            "Обращай внимание на потребности партнёра, но не забывай о своих",
            "Поддерживай баланс между близостью и личным пространством"
        ]
    },
    "B": {
        "name": "📌 ИЗБЕГАЮЩИЙ ТИП: МАСТЕР ДИСТАНЦИИ ",
        "description": "Что это? Твоя базовая стратегия выживания в мире людей. Совокупность внутренних команд, по которым работает твоя психика. \n\nТвоя независимость – как герметичная капсула, и ты в ней не по своему выбору. Мир нельзя контролировать, поэтому ты отыгрываешься на единственном, до чего можешь дотянуться: на безупречном регулировании дистанции с людьми. По сути, ты не самодостаточен, ты просто в бегах. \n\n· Базовая стратегия: Чувствуешь сближение → внутренний шлагбаум захлопывается → включаешь «холод/потерю интереса» → отходишь на безопасную дистанцию\n\nЧто у тебя в голове? Читать здесь👇",
        "characteristics": [
            "Стремление к эмоциональной независимости",
            "Сложности с полным доверием и близостью",
            "Предпочтение самодостаточности над взаимозависимостью",
            "Склонность к эмоциональной закрытости"
        ],
        "recommendations": [
            "Учись постепенно открываться в безопасных отношениях",
            "Работай с установкой 'доверие = опасность'",
            "Практикуй выражение эмоций и просьбы о помощи"
        ]
    },
    "C": {
        "name": "📌 ЗАВИСИМЫЙ ТИП: ЖАЖДА КОНТРОЛЯ ",
        "description": "Что это? Твоя базовая стратегия выживания в мире людей. Совокупность внутренних команд, по которым работает твоя психика. \n\nТы тот, для кого отношения - это вопрос жизни и смерти.  Ты живёшь с радаром, постоянно сканирующим угрозу расставания. Твоя любовь — не чувство, а работа на полную ставку.  Она - тревога в чистом виде. \n\n· Базовая стратегия: Уловил малейший сигнал возможного отдаления → запускается протокол тревоги «ALERT» → начинается сканирование: «Что я сделал не так? Он/она меня разлюбил(а)?» → включается стратегия для «удержания»: допрос, сцены, чрезмерная забота.\n\nЧто у тебя в голове? Читать здесь👇",
        "characteristics": [
            "Высокая потребность в близости и подтверждении чувств",
            "Склонность к ревности и чрезмерному беспокойству",
            "Эмоциональная зависимость от партнёра",
            "Трудности с поддержанием здоровых границ"
        ],
        "recommendations": [
            "Развивай чувство собственной ценности вне отношений",
            "Учись распознавать и управлять тревогой",
            "Практикуй осознанность и доверие к партнёру"
        ]
    },
    "D": {
      "name": "📌 ДЕЗОРГАНИЗОВАННЫЙ ТИП: МИКС «БЕЙ-БЕГИ-ЗАМРИ» ",
      "description": "Что это? Твоя базовая стратегия выживания в мире людей. Совокупность внутренних команд, по которым работает твоя психика. \n\nТы — ходячее противоречие. Сильнейшая потребность в близости сталкивается с паническим ужасом перед ней.Ты разрывается между «подойди ко мне» и «не подходи», и в итоге замираешь в параличе. Твоя стратегия — это отсутствие стратегии. Хаос — твой единственный порядок. \n\n· Базовая стратегия: Возникает возможность близости → мгновенная внутренняя гражданская война: часть тебя рвётся навстречу, другая — в ужасе отпрядывает → результат: непредсказуемая реакция («бей» — вспышка гнева; «беги» — резкий уход; «замри» — ступор, потеря чувств).\n\nКак это контрить?\nЧто у тебя в голове? Читать здесь👇",
      "characteristics": [
        "Смесь избегания и тревоги в отношениях",
        "Непоследовательное поведение и эмоциональные качели",
        "Трудности с регуляцией эмоций",
        "Противоречивые желания относительно близости"
      ],
      "recommendations": [
        "Обратись к психологу для проработки травм привязанности",
        "Учись распознавать и называть свои эмоции",
        "Практикуй постепенное доверие в безопасной обстановке"
      ]
    }
  },
  "questions":  [
    "A. Мне приятно испытывать близость и/или взаимозависимость: легко сближаться с другими людьми, чувствовать свою зависимость от них и их зависимость от меня. Я редко беспокоюсь о том, что меня могут бросить или о том, что кто-то может слишком сильно сблизиться со мной.",
    "B. Мне нелегко сближаться с другими людьми. Я хочу этого, но мне сложно полностью полагаться на людей и зависеть от кого-то. Я боюсь, что если позволю себе довериться другому человеку, он может ранить меня.",
    "C. Я очень нуждаюсь в близости: мне кажется, что люди не хотят сближаться со мной так, как того хотелось бы мне. Я часто беспокоюсь о том, действительно ли мой партнер любит меня и хочет ли оставаться со мной. Я хочу полностью слиться с другим человеком, и это желание порой отпугивает людей.",
    "D. Я могу обходиться без близких эмоциональных отношений; мне важно чувствовать свою свободу и самодостаточность, поэтому я предпочитаю ни от кого не зависеть сам и не вызывать зависимость от меня у других."
],
  "key": {
    "answers_count": 7,
    "A": {
        "yes": {"1": [5, 6, 7]},
        "no": {"1": [1, 2, 3]}
    },
    "B": {
        "yes": {"2": [5, 6, 7]},
        "no": {"2": [1, 2, 3]}
    },
    "C": {
        "yes": {"3": [5, 6, 7]},
        "no": {"3": [1, 2, 3]}
    },
    "D": {
        "yes": {"4": [5, 6, 7]},
        "no": {"4": [1, 2, 3]}
    }
}
}}
